{
  "_name_or_path": "google/vit-base-patch16-224-in21k",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "Abrasions",
    "1": "Bruises",
    "2": "Burns",
    "3": "Cut",
    "4": "Diabetic Wounds",
    "5": "Laseration",
    "6": "Normal",
    "7": "Pressure Wounds",
    "8": "Surgical Wounds",
    "9": "Venous Wounds"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Abrasions": "0",
    "Bruises": "1",
    "Burns": "2",
    "Cut": "3",
    "Diabetic Wounds": "4",
    "Laseration": "5",
    "Normal": "6",
    "Pressure Wounds": "7",
    "Surgical Wounds": "8",
    "Venous Wounds": "9"
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.38.2"
}
